base/Documents/бит_кзн_ПланируемоеПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ПланируемоеПоступлениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ДополнительныеУсловияПоДоговору</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПланированияОплатыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленНаСогласование</Name>
					<Comment>Признак того, что работа с документом завершена и он отправлен на согласование. Используется только в режиме "Проводить документы после утверждения".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_кзн_ВидыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_кзн_ВидыПланов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прогноз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыДенежныхСредств</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Наличные</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
					<Comment>Безналичные</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_КлючиДоступаЦФОСтатьиОборотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_КлючиДоступаЦФОСтатьиОборотов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаДоступа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ГруппыКлючейДоступаЦФОСтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Кассы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассоваяКнига</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассовыеКниги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПлатежиБезУказанияЗаявок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИнкассации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКассаОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперационнаяКасса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКассирОбработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиПлатежейПриПеремещенииДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолучательПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Documents/бит_кзн_ПланируемоеПоступлениеДенежныхСредств/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет наборы значений доступа.
// Параметры:
//  Таблица - ТаблицаЗначений - передает в этот параметр подготовленные наборы значений
//            доступа. Описание колонок см. в функции УправлениеДоступом.ТаблицаНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ДобавитьСтрокуВНаборЗначенийДоступа(Организация, Таблица);
	ДобавитьСтрокуВНаборЗначенийДоступа(Ответственный, Таблица);
	
	ТаблицаДанных = бит_УправлениеДоступомБФСлужебный.ДанныеПозицийПоЗаявке(Ссылка);
	
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
			
	// Удалим дубли
	ПоляГруппировки = "";
	Для каждого Колонка Из Таблица.Колонки Цикл
		ПоляГруппировки = "," + Колонка.Имя + ПоляГруппировки;
	КонецЦикла; 
	
	ПоляГруппировки = Сред(ПоляГруппировки, 2);
	Таблица.Свернуть(ПоляГруппировки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		бит_ОбщегоНазначения.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
		ЗаполнитьНаОснованииПланируемогоПоступленияДенежныхСредств(ДанныеЗаполнения);
	КонецЕсли;
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОтправленНаСогласование = Ложь;
	Ответственный 			= Пользователи.ТекущийПользователь();
	Дата					= ТекущаяДатаСеанса();
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("УстановкаПометкиУдаления", ПометкаУдаления <> Ссылка.ПометкаУдаления);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	РежимЗаписи = ДополнительныеСвойства.РежимЗаписи;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьПравоПроведения(Отказ);
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ВыполнитьСинхронизацию(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьПравоПроведения(Отказ);
	
	ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
	бит_Казначейство.ПроверитьВозможностьПроведения(Ссылка, ТекущийСтатус, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДокументОснование)
		И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.бит_кзн_ПланируемоеПоступлениеДенежныхСредств") Тогда
	
		ДокПрогноз = ДокументОснование.ПолучитьОбъект();
		бит_ВизированиеСервер.УстановитьСтатус(ДокПрогноз);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроверитьПравоПроведения(Отказ);
	
	ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
	бит_Казначейство.ПроверитьВозможностьПроведения(Ссылка, ТекущийСтатус, Отказ);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьНаОснованииПланируемогоПоступленияДенежныхСредств(Основание)

	МетаОснование = Основание.Метаданные();
	
	Если МетаОснование.Имя = "бит_кзн_ПланируемоеПоступлениеДенежныхСредств" Тогда
		
		 Исключения = "Дата,Номер,Проведен,ПометкаУдаления,ДокументОснование,ВидПлана,ОтправленНаСогласование";
		 ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание,,Исключения);
		 ЭтотОбъект.ДокументОснование = Основание.Ссылка;
	
	КонецЕсли; 

КонецПроцедуры

Процедура ИнициализироватьДокумент()
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ВидПлана) Тогда
		ВидПлана = Перечисления.бит_кзн_ВидыПланов.План;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФормаОплаты) Тогда
		ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Инициатор = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
					ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойИнициаторКазначейства);
	
	Если НЕ ЗначениеЗаполнено(Инициатор) Тогда
		Инициатор = Ответственный;
	КонецЕсли;
			
КонецПроцедуры	

#КонецОбласти

Процедура ДобавитьСтрокуВНаборЗначенийДоступа(ЗначениеДоступа, Таблица)
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = ЗначениеДоступа;

КонецПроцедуры

// Процедура выполняет синхронизацию планируемого поступления и позиций поступления. 
//
Процедура ВыполнитьСинхронизацию(Отказ)

	Синхронизировать = Истина;
	Если ДополнительныеСвойства.Свойство("НеСинхронизировать") 
		 И ДополнительныеСвойства.НеСинхронизировать = Истина Тогда
	     Возврат;
	КонецЕсли; 	
	
	БезПомеченныхНаУдаление = Истина;
	Если ДополнительныеСвойства.УстановкаПометкиУдаления Тогда
		БезПомеченныхНаУдаление = Ложь;	
	ИначеЕсли ПометкаУдаления Тогда	
		БезПомеченныхНаУдаление = Ложь;
	КонецЕсли;

	РезультатПоиска = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(Ссылка, БезПомеченныхНаУдаление);
	
	ИменаРеквизитов 	  = Документы.бит_кзн_ПозицияПоступления.СинхронизируемыйРеквизиты();
	НастройкиДопИзмерений = бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений();
	СовпадающиеАналитики  = Документы.бит_кзн_ПозицияПоступления.НайтиАналитикиСовпадающиеСРеквизитами(
								Метаданные.Документы.бит_кзн_ПозицияПоступления);
	
	Для каждого Позиция Из РезультатПоиска.МассивПозиций Цикл

		ПозицияОбъект = Позиция.ПолучитьОбъект();
		
		// Признак того, что дальнейшая синхронизация не нужна, необходимо, чтобы не было циклических синхронизаций.
		ПозицияОбъект.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
		
		// синхронизация пометки удаления
		Если ПометкаУдаления <> ПозицияОбъект.ПометкаУдаления Тогда
			ПозицияОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
		КонецЕсли; 
		
		ТекущаяВалютаДокумента 		= ПозицияОбъект.ВалютаДокумента;
		ТекущаяВалютаВзаиморасчетов = ПозицияОбъект.ВалютаВзаиморасчетов;
		ТекущееПланированиеСуммы	= ПозицияОбъект.ПланированиеСуммы;

		Для каждого Имя Из ИменаРеквизитов Цикл
			
			Если ЭтотОбъект[Имя] <> ПозицияОбъект[Имя] Тогда
				
				ПозицияОбъект[Имя] = ЭтотОбъект[Имя];			
				ЕстьИзменения = Истина;
				
				Если Врег(Имя) = ВРег("Организация") Тогда
					ПозицияОбъект.БанковскийСчет 		  = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
					ПозицияОбъект.Касса			 		  = Справочники.Кассы.ПустаяСсылка();
					ПозицияОбъект.ОбъектРасчетов		  = Неопределено;
					ПозицияОбъект.ОснованиеПлатежа		  = Неопределено;
					ПозицияОбъект.ДоговорКредитаДепозита  = Неопределено;
					ПозицияОбъект.Договор 				  = Неопределено;
				ИначеЕсли Врег(Имя) = ВРег("Контрагент") Тогда
					ПозицияОбъект.ОбъектРасчетов 		   = Неопределено;
					ПозицияОбъект.ОснованиеПлатежа		   = Неопределено;
					ПозицияОбъект.ДоговорКредитаДепозита   = Неопределено;
					ПозицияОбъект.Договор 				   = Неопределено;	
				КонецЕсли; 
				
				// Сихронизируем совпадающие аналитики.
				Для каждого Соотв Из СовпадающиеАналитики Цикл
					Если Соотв.Значение = Имя Тогда
						ТекущаяНастройка = НастройкиДопИзмерений[Соотв.Ключ];
						Если ТекущаяНастройка <> Неопределено И ЗначениеЗаполнено(ПозицияОбъект[Соотв.Ключ])
							И НЕ ТекущаяНастройка.Предопределенная Тогда
							Продолжить;
						КонецЕсли;
						ПозицияОбъект[Соотв.Ключ] = ЭтотОбъект[Имя];
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		КонецЦикла; 
		
		Если ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов Тогда			
			ПозицияОбъект.ВалютаВзаиморасчетов 			 = ВалютаДокумента;
			ПозицияОбъект.ВалютаДокумента	   			 = ВалютаДокумента; 
			ПозицияОбъект.КурсЧислительВзаиморасчетов 	 = 1;
			ПозицияОбъект.КурсЗнаменательВзаиморасчетов  = 1;
			ПозицияОбъект.СуммаДокумента 				 = ПозицияОбъект.СуммаВзаиморасчетов;
		КонецЕсли;
				
		Если ТекущаяВалютаДокумента <> ПозицияОбъект.ВалютаДокумента 
			И ПозицияОбъект.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа Тогда
			
			ПозицияОбъект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
			ПозицияОбъект.Касса 		 = Справочники.Кассы.ПустаяСсылка();
		КонецЕсли;
		
		Если ТекущаяВалютаВзаиморасчетов <> ПозицияОбъект.ВалютаВзаиморасчетов Тогда
			ПозицияОбъект.ОбъектРасчетов		  = Неопределено;
			ПозицияОбъект.ОснованиеПлатежа		  = Неопределено;
			ПозицияОбъект.ДоговорКредитаДепозита  = Неопределено;
			ПозицияОбъект.Договор 				  = Неопределено;
		КонецЕсли;
				
		Если Проведен И НЕ ПозицияОбъект.Проведен Тогда
			Если ПозицияОбъект.ПроверитьЗаполнение() Тогда					
				Выполнено = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ПозицияОбъект, 
					РежимЗаписиДокумента.Проведение, "", "Ошибки");	
				Если НЕ Выполнено Тогда
					Отказ = Истина;
				КонецЕсли;	
			Иначе					
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось записать %1. Документ заполнен с ошибками.'"), Позиция);
			КонецЕсли; 
		ИначеЕсли НЕ Проведен И ПозицияОбъект.Проведен Тогда 
			бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ПозицияОбъект, РежимЗаписиДокумента.ОтменаПроведения, "", "Ошибки");
		Иначе
			ПозицияОбъект.Записать(РежимЗаписиДокумента.Запись);			
		КонецЕсли;
		
		Если Отказ Тогда
			Прервать;		
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры

// Проверка наличия у пользователя права проводить заявки
//
// Параметры:
//  Отказ - Булево.
//
Процедура ПроверитьПравоПроведения(Отказ)
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	флРазрешеноПроводить = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(ТекПользователь, 
		ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноПроводитьПланируемыеПоступленияДС);
	
	Если НЕ флРазрешеноПроводить Тогда		
		ТекстСообщения = НСтр("ru='У пользователя отсутствует дополнительное право на проведение планируемых поступлений ДС.';
							  |en='The user has no right to conduct additional DS planned revenues.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
